Revit 2026 API

# BuildingPadSetBoundary Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetBoundary(
	IList<CurveLoop> curveLoops
)
```
```vb
Public Sub SetBoundary (
	curveLoops As IList(Of CurveLoop)
)
```
```cpp
public:
void SetBoundary(
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
member SetBoundary :
        curveLoops : IList<CurveLoop> -> unit
```

#### Parameters

curveLoops IListCurveLoop

#### Reference

BuildingPad Class

Autodesk.Revit.DB.Architecture Namespace